package heima.biaoshifu;
/*
* 标识符，用来给包，方法，变量名等起名字的符号
* 组成规则：
*   A：unicode字符
*       数字字符，英文大小写字母，汉子（不建议使用汉子）
*   B:下划线 _
*   C:美元符 $
* 注意事项：
*   A：不能以数字开头
*   B：不能是java中的关键字
* 常见命名规则
*   A：基本要求
*       见名知意
*   B：常见的命名
*       a:包（其实就是文件夹。用于对类的管理）
*        全部小写，多几包.隔开
*       b:类
*        一个单次首字母大写
*        举例：Student Car
*        多个单次组成，每个单子首字母大写
*        举例：HelloWord
*       c:方法和变量
*        一个单子首字母小写
*        举例：show，age()
*        多个单子组成第二个单次首字母大写
*        举例：maxAge,getAge()
* */
public class BiaoZhiFu {
}
